app/Controllers/BerandaController.php

    public function index()
    {
        $model = new BerandaModel();
        $db = \Config\Database::connect();

        // Data total (yang sudah ada)
        $data = [
            'balita' => $model->getTotal('tb_data_balita2025_surobayan'),
            'lansia' => $model->getTotal('tb_data_lansia_surobayan'),
            'ibu_hamil' => $model->getTotal('tb_data_ibuhamil_surobayan'),
            'remaja_putri' => $model->getTotal('tb_data_remajaputri2025_surobayan'),
            'usia_produktif' => $model->getTotal('tb_data_usia_produktif_surobayan'),
        ];

        // Data grafik dari tabel per bulan (tanpa filter tahun)
        $balita = $db->table('tb_jumlah_balita_per_bulan')
            ->select('bulan, jumlah_balita')
            ->get()
            ->getResultArray();

        $remaja = $db->table('tb_jumlah_remaja_per_bulan')
            ->select('bulan, jumlah_remaja')
            ->get()
            ->getResultArray();

        $lansia = $db->table('tb_jumlah_lansia_per_bulan')
            ->select('bulan, jumlah_lansia')
            ->get()
            ->getResultArray();
---
SELECT `bulan`, `jumlah_balita`
FROM `tb_jumlah_balita_per_bulan`
SELECT `bulan`, `jumlah_remaja`
FROM `tb_jumlah_remaja_per_bulan`
SELECT `bulan`, `jumlah_lansia`
FROM `tb_jumlah_lansia_per_bulan`